[
    {
      "btn_name": "Hot Forging Manufacturing Details",
      "img": 0,
      "title": "What is Hot Forging",
      "description":"The hot forging process is a forging process in which the metallic material being worked on is heated to a temperature above the crystallization temperature. This is the temperature at which the workpiece or the material is about 75% of its melting temperature. The aim of heating to such temperatures is to lower the flow stress and the pressing force required to form the required product. Unlike cold forging, where the workpiece is worked on at room temperature, hot forging makes the metal easier to shape by heating. Therefore, it works great in the production of hard metals such as iron and its alloys. You just need to get the right hot forging temperature to increase its material ductility. The hot forging process is pretty the same as the cold forging. The only difference is the heating of the workpiece. But the setup is basically the same. You need the material, molds or dies, and equipment to carry out hot forging. For the material, the manufacturing process can work on a vaster range compared to cold forging. There are various types of hot forging, depending on the equipment you are using. The kind of products you are manufacturing is also another factor that determines the choice of hot forging. The most common hot forging types include free forging, roll forging, or die forging. But the most widely used type of hot forging widely used is the die forging.",
      "flag": true
    },
    {
        "btn_name": "Contact Hot Forging India",
        "img": 1,
        "title": "Advantages of Hot forging",
        "description": "The many advantages of hot forging are the reason for its popularity in the manufacturing industry. One of the major advantages is the ability to work on tough metals. A good example is the iron material. With the heating of tough metals such as iron, it becomes easy to work on them. That’s something you can’t do with cold forging. The other benefit of hot forging is high fracture toughness. For the machine wear parts to last for longer, the fracture toughness must be high. When you complete the processing and material temperature is still above the crystallization temperature, the formed parts will have a longer time to grow grains. That’s how fracture toughness or lower crack growth rate is increased. The high temperature used for the hot forging enables the highest possible level of material deformation. If you want to achieve the most complex 3D geometries, then hot forging is the ideal manufacturing process. With the high material deformation, you can easily get the shape that you want. Hot forging increases the ductility of the materials. With the heating of the metallic material to crystallization temperature, it can undergo significant plastic deformation. That’s why it is very easy to get even the most complex shapes with hot forging. The other advantage of hot forging is the excellent surface quality that allows for a range of finishing work.",
        "flag": true
    },
    {
        "btn_name": "More Details About Hot Forging China",
        "img": 1,
        "title": "About Hot Forging China",
        "description": "Since its establishment in 2021, Cxin forging has developed rapidly, and its products are exported to America, Europe, Australia, Asia, and other countries and regions. Cxin forging takes forging, research, and development- design three basic technologies as the core. Relying on the one-stop production system based on the spirit of manufacturing artisan, we focus on the hot forging process of carbon steel, aluminum alloy, stainless steel products, with the manufacturing capacity of rapid production and low-cost production. There is a continuous inspection of operational and production quality to ensure that defective products are not delivered as final products. All forging products, from the design, materials, process, and finished products, are carefully considered to ensure customer approval. Cxin forging is one of the leading hot forging manufacturers in China. We are responsible for providing and ensuring that Cxin forging products become your reliable trading partner. As a leading forging company, we will continue to be aggressive.", 
        "flag": false
    }
]
  